{
  "_fv": 6,
  "_type": "procedure",
  "definition": {
    "procedurexml": "<xml xmlns=\"https://developers.google.com/blockly/xml\"><block type=\"event_trigger\" deletable=\"false\" x=\"76\" y=\"34\"><field name=\"trigger\">On player tick update</field></block><block type=\"controls_if\" x=\"530\" y=\"247\"><value name=\"IF0\"><block type=\"logic_binary_ops\" inline=\"false\"><field name=\"OP\">AND</field><value name=\"A\"><block type=\"entity_has_achievement\"><field name=\"achievement\">CUSTOM:TheGuide</field></block></value><value name=\"B\"><block type=\"logic_negate\"><value name=\"BOOL\"><block type=\"entity_has_achievement\"><field name=\"achievement\">CUSTOM:TheGuideCompleted</field></block></value></block></value></block></value><statement name=\"DO0\"><block type=\"entity_execute_command\"><value name=\"command\"><block type=\"text\"><field name=\"TEXT\">give @p written_book 1 0 {pages:[\"[\"\",{\"text\":\"Welcome to Wastelands!\",\"bold\":true},{\"text\":\"&#10;This book will try to explain you the basics of what your journey will cast upon you.&#10;&#10;You can find details in longer guide. There is also appendix bound to this guide, showing guns statistics.\",\"color\":\"reset\"}]\",\"[\"\",{\"text\":\"I. AIRSHIPS\",\"bold\":true},{\"text\":\"&#10;The only source for wasteland items is found on airships - there are several types of them, spread throughout whole world.&#10;&#10;1a. Bandit Airship&#10;You will find bandit spawner and a lot of treasures there. Also, some basic guns.\",\"color\":\"reset\"}]\",\"{\"text\":\"1b. Mage Airship&#10;Mysterious, blue airship with some hidden story behind it. You can probably find some rare resources there.&#10;&#10;1c. Trader Airship&#10;Currently under development. Once revamped, it will have some exclusive items that can't be found anywhere else.\"}\",\"{\"text\":\"1d. Military Airship&#10;Currently under development. When fully introduced, it will contain some heavy militaristic elements that will be exclusive for that airship.&#10;&#10;1e. Jungle Airship&#10;Rare airship found in jungle, home of ormath tribes.\"}\",\"[\"\",{\"text\":\"II. GUNS\",\"bold\":true},{\"text\":\"&#10;Guns are second most important element of wastelands. You can craft the most basic one, or create others using firearm table (found in airships). Most guns require specific elements to be created. More informations can be found in appendix.\",\"color\":\"reset\"}]\",\"[\"\",{\"text\":\"III. Resources\",\"bold\":true},{\"text\":\"&#10;In Wastelands, you will find a lot of new resources and items. One of the most important ones are baedoor gold ingots - they can be created either from smelting baedoor coins or by processing pale gold ingot (obtained by merging gold and glistering ash)\",\"color\":\"reset\"}]\",\"{\"text\":\"Baedoor Gold can be used for decoration and specific technical blocks, such as:&#10;* fluid tank heater&#10;* heat fueler&#10;&#10;These technical blocks can be used with redstone power to specific actions, allowing you to control the environment in different way.\"}\",\"{\"text\":\"Other resources you could like to use:&#10;* lockable chests (allows you to lock them with key)&#10;* wooden variants, such as chiseled versions, lamps and more&#10;* blue nether bricks&#10;* storage blocks for cobblestone, netherrack and end stone\"}\",\"[\"\",{\"text\":\"IV. Herbs\",\"bold\":true},{\"text\":\"&#10;There are three herbs at the moment, giving you possibility to use them in different way. They can be found on different airships.&#10;* sand and ash veil - give you possibility to farm sand and vulcanic sand&#10;* tsua - gives you possibility to gather ink sacks\",\"color\":\"reset\"}]\",\"[\"\",{\"text\":\"V. Mobs\",\"bold\":true},{\"text\":\"&#10;Wandering across the lands, you can encounter various mobs, including:&#10;* bandits - dangerous if found in groups&#10;* ormaths - peaceful beings, if not provoked&#10;* wind spirits - summoned by ormath shamans and found on deserts\",\"color\":\"reset\"}]\",\"[\"\",{\"text\":\"VI. The Journey Never Ends\",\"bold\":true},{\"text\":\"&#10;Wastelands offer also a lot of compatibilities between other mods. You can check them on official site.&#10;&#10;I hope this small guide helped you, stranger, so you can wander across the lands a bit safer.\",\"color\":\"reset\"}]\"],title:\"Wasteland Guide\",author:Gunslinger}</field></block></value><next><block type=\"entity_execute_command\"><value name=\"command\"><block type=\"text\"><field name=\"TEXT\">give @p written_book 1 0 {pages:[\"[\"\",{\"text\":\"Gun Appendix\",\"bold\":true},{\"text\":\"&#10;In this appendix I will try to explain each firearm.&#10;&#10;Remember that you need to find out the recipes for each element and scheme, and for most of them you need firearm table!\",\"color\":\"reset\"}]\",\"[\"\",{\"text\":\"Mechanics\",\"bold\":true},{\"text\":\"&#10;&#10;Shooting firearm require you to load bullets (\"R\") to the gun. After that you can shoot them (\"right-click\"), remembering that your experience counts - it affects your gun accuracy and reliability\",\"color\":\"reset\"}]\",\"{\"text\":\"Reliability depends also on individual gun properties. Generally each gun has different characteristics, making it different to play (they differ with time of reload, shooting, reload mechanics, accuracy, and so on).\"}\",\"{\"text\":\"I. Handmade Revolver&#10;&#10;It's the only gun you can craft on crafting table. You need revolver grip, iron ingot, short barrel and blaze rod for it.&#10;&#10;It uses gunpowder as an ammo and shots single, weak bullets.\"}\",\"{\"text\":\"II. Pepper Gun&#10;&#10;It's expansion of handmade revolver. Increases shooting radio drastically.&#10;It uses small bullets and can be expanded further to enhanced pepper box with craftable scheme.\"}\",\"{\"text\":\"III. Short Revolver&#10;&#10;Rare revolver found in airships. Considered as one of the fastest ones and one of the most balanced. Uses small bullets. Can be crafted with use of treasure scheme.\"}\",\"{\"text\":\"IV. Long Revolver&#10;&#10;Stronger, yet slower alternative for short revolver. It is similarly rare, or even more, since it is rarely seen in use by bandits.\"}\",\"{\"text\":\"V. Elephant Gun&#10;&#10;Simple, yet powerful rifle. Uses long bullets, giving one, yet powerful shot in a long distance. Has pretty decent reload time.\"}\",\"{\"text\":\"VI. Crocodile Shotgun&#10;&#10;Powerful shotgun with some advanced mechanisms inside. Uses slugs as ammo. Can be deadly on closer distances, but works well even on moderate ones.\"}\",\"{\"text\":\"VII. Lefs9&#10;&#10;Lefs9 is infantry revolver, using standard small bullets. It is kinda tough to use, but offers really huge clip size, which can be used as an advantage. Can be crafted from treasure scheme.\"}\",\"{\"text\":\"VIII. Ayer Shotgun (and Sawed-Off)&#10;&#10;One of the simplest guns you can craft easily at the start. It has quite huge power considering being craftable without scheme.&#10;Uses slugs.\"}\",\"{\"text\":\"IX. Rusty Reaper&#10;&#10;Alternative for Ayer Shotgun. With kinda different reload mechanics and statistics, it is just different, yet similarly primitive gun. Uses slugs.\"}\",\"{\"text\":\"X. Windsweeper&#10;&#10;Long reload and powerful damage. This is basically windsweeper, crafted as an enhancement of elephant gun.&#10;Uses large bullets.\"}\",\"{\"text\":\"XI. Sand Wanderer&#10;&#10;Gun used by desert nomands, being powerful, two-clipped rifle. It is probably one of the favourite rifles, considering it unmatched speed.&#10;Uses large bullets.\"}\"],title:\"Gun Appendix\",author:Gunslinger}</field></block></value><next><block type=\"entity_add_achievement\"><field name=\"achievement\">CUSTOM:TheGuideCompleted</field></block></next></block></next></block></statement></block></xml>"
  }
}